
/// АВТОР Бренкман Андрей (Brenkman Andrey)
/// ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 27.02.2009
/// УРОВЕНЬ МОЕГО ДОВЕРИЯ 70%


///!
#include "a_move_list_struct.h"
#include "a_pv_line_struct.h"

/// линия главного варианта

namespace PV_save
{

/// поля класса
//////////////////////////////////////////////////////////////////////////////////////
//private:

//////////////////////////////////////////////////////////////////////////////////////
//public:

	///---------------------------------------------------------------------------
	/// возвращаем лучший вариант
	struct PV_line & get_pv_best();

	///---------------------------------------------------------------------------
	/// возвращаем текущий вариант
	struct PV_line & get_pv_current();

	///---------------------------------------------------------------------------
	/// обновляем линию лучшего варианта в узле
	void update_PV_best_point
	(
		struct PV_line & PV_best_point/// лучший вариант найденный в узле
	);

	///---------------------------------------------------------------------------
	/// обновляем линию лучшего варианта
	void update_PV_best
	(
		const struct PV_line & PV_best_point/// лучший вариант найденный в узле
	);

	///---------------------------------------------------------------------------
	/// обновляем линию лучшего варианта на максимальной глубине
	void update_PV_best_max_depth
	(
		const __int32 & score,/// оценка позиции в конце варианта
		const unsigned __int8 & depth/// текущая глубина
	);

	///---------------------------------------------------------------------------
	/// записываем ход в текущий вариант
	void update_PV_current
	(
		const unsigned __int8 & i,/// номер хода в списке ходов
		const unsigned __int8 & depth,/// текущая глубина
		const struct List & list_surplus_moves///список возможных ходов
	);

//////////////////////////////////////////////////////////////////////////////////////
//public:

};
