
/// АВТОР Бренкман Андрей (Brenkman Andrey)
/// ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 20.11.2010
/// УРОВЕНЬ МОЕГО ДОВЕРИЯ 50%


///!
#include "a_position_struct.h"


/*
 использую для теста
*/

namespace Test_chess_bitboard
{

//////////////////////////////////////////////////////////////////////////////////////
//public:

	///---------------------------------------------------------------------------
	/// печатаем 64 битное число как доску. использую для теста 
	void print_bitboard_map
	(
		const unsigned __int64 mask //
	);

	///---------------------------------------------------------------------------
	/// использую для теста
	void print_name_from_coord
	(
		const struct Position & position/// представление доски
	);

	///---------------------------------------------------------------------------
	/// использую для теста. записываем доску
	void save_test_bitboard
	(
		struct Position & position_save,/// представление доски
		const struct Position & position/// представление доски
	);

	///---------------------------------------------------------------------------
	/// использую для теста. сравниваем доски
	void compare_test_bitboard
	(
		const struct Position & position_1,/// представление доски
		const struct Position & position_2/// представление доски
	);

	///---------------------------------------------------------------------------
	/// это тестовая функция нужная для проверки методов списка
	/// печатаем битбоард(bit board) доску
	void bitboard_print
	(
		const struct Position & position/// представление доски
	);

};