//-----------------------------------------------------------------------------------
/* +
 * задаем функции по работе с временем
 *
 * АВТОР ChessTerminator75
 * ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 2.1.2007
*/

//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
// запускаем таймер	
void Timer_start();

//-----------------------------------------------------------------
// останавливаем таймер	
void Timer_stop();

//-----------------------------------------------------------------
// вычисляем прошедшее время (результат в милисикундах?)
double Timer_delta();

//---------------------------------------------------------------------------
// запускаем таймер	
void Timer_start_d();

//-----------------------------------------------------------------
// останавливаем таймер	
void Timer_stop_d();

//-----------------------------------------------------------------
// вычисляем прошедшее время (результат в милисикундах?)
double Timer_delta_d();




