#include <time.h>

//---------------------------------------------------------------------------
/* +
 * АВТОР Бренкман Андрей (Brenkman Andrey)
 * ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 25.02.2009    5.12.2009
*/
//---------------------------------------------------------------------------

/*
 УРОВЕНЬ МОЕГО ДОВЕРИЯ 70%

 задаем функции по работе с временем
 определение времени счета
*/

namespace TIMER
{
	//---------------------------------------------------------------------------
	// фиксируем начальное время
	void public_time_start();

	//-----------------------------------------------------------------
	// фиксируем текущее время
	void public_time_stop();

	//-----------------------------------------------------------------
	// вычисляем прошедшее время (результат в секундах)
	double public_time_delta();
}
