#include <iostream.h>
#include <time.h>
#include "k_Timer.h"

//-----------------------------------------------------------------------------------
/* +
 * задаем функции по работе с временем
 *
 * АВТОР ChessTerminator75
 * ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 2.01.2008
 *
 *  ТЕСТИРОВАНИЕ
 * непосредственных тестов нет
*/

//---------------------------------------------------------------------------

// глобальные переменные

time_t  start,end;// определяем переменные старта и остановки секундомера
//clock_t start_c,end_c;
double start_c,end_c;
double start_d,end_d;// для углубения
//	===================================================================
// запускаем таймер	
void Timer_start(){
 time (&start);
 start_c = (double)clock();
}//void Timer_start(){
//	*******************************************************************

//	===================================================================
// останавливаем таймер	
void Timer_stop(){
 time (&end);
 end_c = (double)clock();
}//void Timer_stop(){
//	*******************************************************************

//	===================================================================
// вычисляем прошедшее время (результат в милисикундах?)
double Timer_delta(){
//  return difftime (end,start);
// return double(end_c-start_c)/ double(CLOCKS_PER_SEC);
 return (end_c-start_c)/ (double)(CLOCKS_PER_SEC);
}//void Timer_stop(){
//	*******************************************************************


//	===================================================================
// запускаем таймер	
void Timer_start_d(){
 start_d = (double)clock();
}//void Timer_start(){
//	*******************************************************************

//	===================================================================
// останавливаем таймер	
void Timer_stop_d(){
 end_d = (double)clock();
}//void Timer_stop(){
//	*******************************************************************

//	===================================================================
// вычисляем прошедшее время (результат в милисикундах?)
double Timer_delta_d(){
 return (end_d-start_d)/ (double)(CLOCKS_PER_SEC);
}//void Timer_stop(){
//	*******************************************************************






