#include "k_structure.h"
//-----------------------------------------------------------------------------------
/*
 * перебор позиций
 *
 * АВТОР ChessTerminator75
 * ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 5.1.2008
*/


//---------------------------------------------------------------------------
#define TEST_Sor 0; // включаем-выключаем(1-0) режим вывода в файл тестовой информации

//---------------------------------------------------------------------------
// сортируем взятия возвращаем количество взятий
int Sorting_captures_moves(T_list_surplus_moves * list_surplus_moves);



