#include "k_structure.h"

//-----------------------------------------------------------------------------------
/*
 * реализуем киллеров
 *
 * АВТОР ChessTerminator75
 * ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 13.1.2008
 *
*/
//---------------------------------------------------------------------------


#define TEST_K 0; // включаем-выключаем(1-0) режим вывода в файл тестовой информации

//---------------------------------------------------------------------------
void Save_killer(int i,T_list_surplus_moves * list_surplus_moves,int depth);

//---------------------------------------------------------------------------
void Insert_killer(T_list_surplus_moves * list_surplus_moves,int depth,int start);

