
/// АВТОР Бренкман Андрей (Brenkman Andrey)
/// ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 20.11.2010
/// УРОВЕНЬ МОЕГО ДОВЕРИЯ 50%


///!
#include "a_Header_constants.h"
#include "a_Position.h"



/// использую для теста


class i_Test_chess_bitboard
{

//////////////////////////////////////////////////////////////////////////////////////
public:

	///---------------------------------------------------------------------------
	/// использую для теста
	void print_name_from_coord
	(
		const struct Position & position/// представление доски
	);

	///---------------------------------------------------------------------------
	/// использую для теста. записываем доску
	void save_test_bitboard
	(
		struct Position & position_save,/// представление доски
		const struct Position & position/// представление доски
	);

	///---------------------------------------------------------------------------
	/// использую для теста. сравниваем доски
	void compare_test_bitboard
	(
		const struct Position & position_1,/// представление доски
		const struct Position & position_2/// представление доски
	);

	///---------------------------------------------------------------------------
	/// это тестовая функция нужная для проверки методов списка
	/// печатаем битбоард(bit board) доску
	void bitboard_print
	(
		const struct Position & position/// представление доски
	);

};