
/// АВТОР Бренкман Андрей (Brenkman Andrey)
/// ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 20.11.2010
/// УРОВЕНЬ МОЕГО ДОВЕРИЯ 70%


///!
#include "Header_constants.h"
#include "List.h"

/// включаем-выключаем(1-0) контроль списка ходов
#define KONTROL_B 0 

/// 
#define TEST_H 0 





/// сортировка списка ходов
/// сортируем по предварительной оценке ходов

namespace Sorting_moves 
{


//////////////////////////////////////////////////////////////////////////////////////
//public:

	///---------------------------------------------------------------------------
	/// полная сортировка
	void sorting_moves_captures
	(
		struct List & list/// представление списка ходов
	);

	///---------------------------------------------------------------------------
	/// полная сортировка корневого списка
	void sorting_moves_history
	(
		struct List & list/// представление списка ходов
	);

	///---------------------------------------------------------------------------
	/// полная сортировка корневого списка
	void sorting_white_moves_root
	(
		struct List & list/// представление списка ходов
	);

	///---------------------------------------------------------------------------
	/// полная сортировка корневого списка
	void sorting_black_moves_root
	(
		struct List & list/// представление списка ходов
	);

};