#include <time.h>
//-----------------------------------------------------------------------------------
/* +
 * задаем функции по работе с временем
 *
 * АВТОР ChessTerminator75
 * ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 25.02.2009
*/

//---------------------------------------------------------------------------

/*******************************************

  класс для определения времени счета

********************************************/
class TIMER{

clock_t start_timer,finish_timer;// таймер для общего времени счета
double out;// время выводим в секундах

//////////////////////////////////////////////////////////////////////////////////////////
public:

//---------------------------------------------------------------------------
// запускаем таймер	
void Timer_start();

//-----------------------------------------------------------------
// останавливаем таймер	
void Timer_stop();

//-----------------------------------------------------------------
// вычисляем прошедшее время (результат в секундах)
double Timer_delta();

};//class TIMER
