#include "a_structure.h"
//-----------------------------------------------------------------------------------
/*
 * запись линии варианта
 *
 * АВТОР ChessTerminator75
 * ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 27.02.2009
*/
//-----------------------------------------------------------------------------------

/*******************************************

  класс отвечает за запись линии главного варианта

********************************************/
class PVSAVE{

struct T_PV pv_current;// текущий вариант
struct T_PV pv_best;// лучший вариант

//////////////////////////////////////////////////////////////////////////////////////////
public:

//---------------------------------------------------------------------------
// возвращаем лучший вариант
struct T_PV * get_pv_best();

//---------------------------------------------------------------------------
// возвращаем текущий вариант
struct T_PV * get_pv_current();

//---------------------------------------------------------------------------
// обновляем линию лучшего варианта в узле
void Update_PV_best_point(struct T_PV * const p_PV_best_point// лучший вариант найденный в узле
						  );

//---------------------------------------------------------------------------
// обновляем линию лучшего варианта
void Update_PV_best(const struct T_PV * const p_PV_best_point// лучший вариант найденный в узле
					);

//---------------------------------------------------------------------------
// обновляем линию лучшего варианта на максимальной глубине
void Update_PV_best_max_depth(const __int32 & score,// оценка позиции в конце варианта
							  const unsigned __int8 & depth// текущая глубина
							  );

//---------------------------------------------------------------------------
// записываем ход в текущий вариант
void Update_PV_current(const unsigned __int8 & i,// номер хода в списке ходов
					   const unsigned __int8 & depth,// текущая глубина
					   const struct T_list_surplus_moves * const p_list_surplus_moves// список ходов
					   );

};//class PVSAVE
