
/// АВТОР Бренкман Андрей (Brenkman Andrey)
/// ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 25.02.2009 5.12.2009
/// УРОВЕНЬ МОЕГО ДОВЕРИЯ 70%


///!
#include <time.h>


/// задаем функции по работе с временем
/// определение времени счета

namespace Timer
{

/// поля класса
//////////////////////////////////////////////////////////////////////////////////////
//private:


//////////////////////////////////////////////////////////////////////////////////////
//public:

	///---------------------------------------------------------------------------
	/// фиксируем начальное время
	void time_start();

	///-----------------------------------------------------------------
	/// фиксируем текущее время
	void time_stop();

	///-----------------------------------------------------------------
	/// вычисляем прошедшее время (результат в секундах)
	double time_delta();

};
