
// АВТОР Бренкман Андрей (Brenkman Andrey)
// ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 25.02.2009 5.12.2009

//!
#include <time.h>

/*
 УРОВЕНЬ МОЕГО ДОВЕРИЯ 70%

 задаем функции по работе с временем
 определение времени счета
*/

class Timer
{

// поля класса
//////////////////////////////////////////////////////////////////////////////////////
private:

	// таймер для общего времени счета
	clock_t start_timer; 
	clock_t finish_timer;


//////////////////////////////////////////////////////////////////////////////////////
public:

	//---------------------------------------------------------------------------
	// фиксируем начальное время
	void time_start();

	//-----------------------------------------------------------------
	// фиксируем текущее время
	void time_stop();

	//-----------------------------------------------------------------
	// вычисляем прошедшее время (результат в секундах)
	double time_delta();

};
