#include "k_structure.h"
//-----------------------------------------------------------------------------------
/* +
 * оценка позиции
 *
 * АВТОР ChessTerminator75
 * ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 10.02.2008
*/
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
//static __inline int first_one(unsigned __int64 bm);

//---------------------------------------------------------------------------
//static __inline int last_one(unsigned __int64 bm);

//---------------------------------------------------------------------------
// функция получает позицию и оценивает ее статически
// аргументы : доска
int Eval_State(const T_Bitboard * bitboard);

//---------------------------------------------------------------------------
// функция получает позицию и оценивает материал и только
int Eval_forced(const T_Bitboard * bitboard);

//---------------------------------------------------------------------------
// штраф за разрушение щита перед королем
int King_shield(int n,int z,const T_Bitboard * bitboard);

//---------------------------------------------------------------------------
// просчитываем все возможные ходы ладьи возвращаем количество ходов
//int Rook_amoun_816(int n,T_board_list_816 * board_list_816);

//---------------------------------------------------------------------------
// просчитываем все возможные ходы слона возвращаем количество ходов
//int Bishop_amoun_816(int n,T_board_list_816 * board_list_816);