#include "k_structure.h"
//-----------------------------------------------------------------------------------
/*
 * перебор позиций
 *
 * АВТОР ChessTerminator75
 * ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 5.1.2008
*/

//---------------------------------------------------------------------------
// обновляем линию лучшего варианта в узле
void Update_PV_best_point(T_PV * pv_best_point,T_PV * pv_best);

//---------------------------------------------------------------------------
// обновляем линию лучшего варианта
void Update_PV_best(T_PV * pv_best,T_PV pv_best_point);

//---------------------------------------------------------------------------
// обновляем линию лучшего варианта на максимальной глубине
void Update_PV_best_max_depth(int score,int depth,T_PV * pv_best,T_PV * pv_current);

//---------------------------------------------------------------------------
// записываем ход в текущий вариант
void Update_PV_current(int i,int depth,T_PV * pv_current,const T_list_surplus_moves * list_surplus_moves);

