#include <iostream>

#include "k_Util.h"

//---------------------------------------------------------------------------
/* +
 * АВТОР Бренкман Андрей (Brenkman Andrey)
 * ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 21.07.2007
*/
//---------------------------------------------------------------------------

/*
 УРОВЕНЬ МОЕГО ДОВЕРИЯ 90%

 задаем функции по работе с массивом шахматной доски
 весь модуль сборник самых древних функции кода!
 перешли еще из моей самой первой программы  And_chess 
 написанной на джаве(java) в районе 9.01.06
*/

//	===================================================================
// функция встречалось в коде Анд чесс(Andchess) от 9.01.06 
// сохраню как историческую ценность :)) 
// конвертируем число фигуры в букву
// 0-нет фигуры, 1-пешка, 2-конь, 3-слон, 4-ладья, 5-ферзь, 6-король	
char UTIL::public_int_to_char_board
(
	const int i,// код фигуры
	const int z// цвет фигуры
)
{
	char ch = ' ';
	if (z == 0)
	{
		if (i == 0) ch = 'x'; 
		if (i == 1) ch = 'p'; 
		if (i == 2) ch = 'n'; 
		if (i == 3) ch = 'b'; 
		if (i == 4) ch = 'r'; 
		if (i == 5) ch = 'q'; 
		if (i == 6) ch = 'k'; 
	}
	else
	{
		if (i == 0) ch = 'x'; 
		if (i == 1) ch = 'P'; 
		if (i == 2) ch = 'N'; 
		if (i == 3) ch = 'B'; 
		if (i == 4) ch = 'R'; 
		if (i == 5) ch = 'Q'; 
		if (i == 6) ch = 'K'; 
	}
	return ch;
}

//	===================================================================
// конвертируем букву фигуры в число
// 0-нет фигуры, 1-пешка, 2-конь, 3-слон, 4-ладья, 5-ферзь, 6-король	
int UTIL::public_char_to_int_board
(
	const char f// символ фигуры
)
{
	int i = -1;
	if (f == 'x') i = 0; 
	if ((f == 'p')||(f == 'P')) i = 1;  
	if ((f == 'n')||(f == 'N')) i = 2;  
	if ((f == 'b')||(f == 'B')) i = 3;  
	if ((f == 'r')||(f == 'R')) i = 4; 
	if ((f == 'q')||(f == 'Q')) i = 5;  
	if ((f == 'k')||(f == 'K')) i = 6;   
	return i;
}

//	===================================================================
//	по координате х доски выдаем букву нотации например 0 - а	
char UTIL::public_x_to_notation
(
	const int x//горизонтальная координата доски (0-7)
)
{
	if (x == 0) return 'a';
	if (x == 1) return 'b';
	if (x == 2) return 'c';
	if (x == 3) return 'd';
	if (x == 4) return 'e';
	if (x == 5) return 'f';
	if (x == 6) return 'g';
	if (x == 7) return 'h';
	return 'o';
}





