#include "k_structure.h"
//-----------------------------------------------------------------------------------
/*
 * перебор с циклическим увеличением глубины
 *
 * АВТОР ChessTerminator75
 * ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 10.02.2008
*/


//---------------------------------------------------------------------------
#define TEST_D 0; // включаем-выключаем(1-0) режим вывода в файл тестовой информации

//---------------------------------------------------------------------------
// аргументы : доска(138),глубина расчета,лучший ход,оценка,количество просмотренных узлов,вариант
void Deepening(T_Bitboard * bitboard,int depth,char three_position[],T_PV three_moves,int & nodes,double wtime,double btime, double winc,double binc,int movestogo,double movetime,bool infinite);

//---------------------------------------------------------------------------