#include "k_structure.h"
//-----------------------------------------------------------------------------------
/*
 * реализуем битбоард генератор
 *
 * АВТОР ChessTerminator75
 * ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 1.03.2008
 *
*/
//---------------------------------------------------------------------------

#define TEST_B 0;   // включаем-выключаем(1-0) режим вывода в файл тестовой информации
#define KONTROL_B 0 // включаем-выключаем(1-0)
//---------------------------------------------------------------------------
static __inline int first_one(unsigned __int64 bm);

//---------------------------------------------------------------------------
static __inline int last_one(unsigned __int64 bm);

//---------------------------------------------------------------------------
void Generator_captures(const T_Bitboard * bitboard,T_list_surplus_moves * list_surplus_moves);

//---------------------------------------------------------------------------
void Generator_move(const T_Bitboard * bitboard,T_list_surplus_moves * list_surplus_moves);

//---------------------------------------------------------------------------
// под боем ли король
int King_check(const T_Bitboard * bitboard);

//---------------------------------------------------------------------------
// разрешение на рокировку
int King_castling(int sq,const T_Bitboard * bitboard);

//---------------------------------------------------------------------------
// под боем ли белые поля
int White_check_square(int sq,const T_Bitboard * bitboard);

//---------------------------------------------------------------------------
// под боем ли черные поля
int Black_check_square(int sq, const T_Bitboard * bitboard);

//---------------------------------------------------------------------------
#if TEST_B
 void Bitboard_print(const T_Bitboard * bitboard);
#endif//TEST_B
//---------------------------------------------------------------------------
//
void Bitboard_ini_t(T_Bitboard * bitboard);


