#include <time.h>
//---------------------------------------------------------------------------
/* +
 * АВТОР Бренкман Андрей (Brenkman Andrey)
 * ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 25.02.2009    5.12.2009
*/
//---------------------------------------------------------------------------

/*
 задаем функции по работе с временем
 определение времени счета
*/

namespace TIMER{

//////////////////////////////////////////////////////////////////////////////////////////
//public:

//---------------------------------------------------------------------------
// фиксируем начальное время
void Time_start();

//-----------------------------------------------------------------
// фиксируем текущее время
void Time_stop();

//-----------------------------------------------------------------
// вычисляем прошедшее время (результат в секундах)
double Time_delta();

};//namespace TIMER
