#include "k_structure.h"
//-----------------------------------------------------------------------------------
/*
 * реализуем битбоард генератор
 *
 * АВТОР ChessTerminator75
 * ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 1.03.2008
 *
*/
//---------------------------------------------------------------------------

#define TEST_B 0;   // включаем-выключаем(1-0) режим вывода в файл тестовой информации
#define KONTROL_B 0 // включаем-выключаем(1-0)
//---------------------------------------------------------------------------
// ищем первый установленный бит(т.е. бежим справа)
//static __inline int first_one(unsigned __int64 bm);

//---------------------------------------------------------------------------
// ищем последний установленный бит(т.е. бежим слева)
//static __inline int last_one(unsigned __int64 bm);

//---------------------------------------------------------------------------
// под боем ли белые поля если шаха нет то функция возвращает 0 иначе цифру шахующей фигуры
 inline int White_check_square(int sq,const T_Bitboard * bitboard);

//---------------------------------------------------------------------------
// под боем ли черные поля если шаха нет то функция возвращает 0 иначе цифру шахующей фигуры
 inline int Black_check_square(int sq, const T_Bitboard * bitboard);

//---------------------------------------------------------------------------
// генерируем список взятий и превращений пешки
void Generator_captures_white(const T_Bitboard * bitboard,T_list_surplus_moves * list_surplus_moves);

//---------------------------------------------------------------------------
// генерируем список взятий и превращений пешки
void Generator_captures_black(const T_Bitboard * bitboard,T_list_surplus_moves * list_surplus_moves);


//---------------------------------------------------------------------------
// генерируем список остальных ходов (т.е. всех ходов кроме взятий и превращений пешек)
void Generator_move_white(const T_Bitboard * bitboard,T_list_surplus_moves * list_surplus_moves);

//---------------------------------------------------------------------------
// генерируем список остальных ходов (т.е. всех ходов кроме взятий и превращений пешек)
void Generator_move_black(const T_Bitboard * bitboard,T_list_surplus_moves * list_surplus_moves);

//---------------------------------------------------------------------------
// под боем ли король белых если шаха нет то функция возвращает 0 иначе цифру шахующей фигуры
int King_white_check(const T_Bitboard * bitboard);

//---------------------------------------------------------------------------
// под боем ли король черных если шаха нет то функция возвращает 0 иначе цифру шахующей фигуры
int King_black_check(const T_Bitboard * bitboard);

//---------------------------------------------------------------------------
// печатаем битбоард доску
#if TEST_B
 void Bitboard_print(const T_Bitboard * bitboard);
#endif//TEST_B
//---------------------------------------------------------------------------
// начальная инициализация доски
void Bitboard_ini_t(T_Bitboard * bitboard);


