#include "k_structure.h"
//-----------------------------------------------------------------------------------
/*
 * обробатываем команду на старт
 *
 * АВТОР ChessTerminator75
 * ПОСЛЕДНЕЕ ИЗМЕНЕНИЕ 8.1.2007
*/
//---------------------------------------------------------------------------

//-----------------------------------------------------------------------------------
// есть ли в строке искомая подстрока
// аргументы :строка, строка
static bool string_equal(const char s1[], const char s2[]);

//-----------------------------------------------------------------------------------
// есть ли в начале строки искомая подстрока
// аргументы :строка, строка
static bool string_start_with(const char s1[], const char s2[]);

//-----------------------------------------------------------------------------------

//---------------------------------------------------------------------------
// преобразуем строку с ходами
// аргументы: обычно представленыеходы(аннотация),внутренне представленные ходы(для одномерной доски)
void transformation_moves(char three_position[],T_PV * three_moves);
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
// выделяем строку с ходами
// аргументы: строка,строка
void parse_three_position(const char string_in[],char three_position[]);
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
// обрабатываем команду на старт и запускаем перебор
// аргументы :входящая строка,строка, доска(138)
// строка нужна для установки глубины перебора 
void parse_go(T_Bitboard * bitboard,const char string_in[],char three_position[],int & nodes);

//---------------------------------------------------------------------------